app/controllers/order_items_controller.rb

  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.order_status_id = 1
    @order.save
---
INSERT INTO "order_items" ("product_id", "unit_price", "quantity", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 10], ["unit_price", 30.0], ["quantity", 1], ["total_price", 30.0], ["created_at", "2017-11-06 06:23:16.745456"], ["updated_at", "2017-11-06 06:23:16.745456"]]