app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%test%') ORDER BY created_at DESC
---
  def index
    @products = Product.all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."product_id" = ?  [["product_id", 7]]
---
  def show
    @product = Product.find(params[:id])
    @order_item = current_order.order_items.new
    @ratings = @product.ratings.includes(:user).all

INSERT INTO "products" ("title", "description", "long_description", "price", "commision", "is_active", "created_at", "updated_at", "asset_file_name", "asset_content_type", "asset_file_size", "asset_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "images" ("product_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)
    respond_to do |format|
      if @product.save

        if params[:images]
          params[:images].each { |image|
            @product.images.create(image: image)

UPDATE "products" SET "title" = ?, "description" = ?, "long_description" = ?, "price" = ?, "commision" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", ""], ["description", ""], ["long_description", ""], ["price", nil], ["commision", nil], ["updated_at", "2017-11-02 23:36:29.744116"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)