app/controllers/registrations_controller.rb

INSERT INTO "roles" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "user"], ["created_at", "2017-11-06 09:42:20.958626"], ["updated_at", "2017-11-06 09:42:20.958626"]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "username", "first_name", "last_name", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "sign_in_count" = ?, "current_sign_in_at" = ?, "last_sign_in_at" = ?, "current_sign_in_ip" = ?, "last_sign_in_ip" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def create
    build_resource(sign_up_params)
  if params[:user][:role] == "seller"
    resource.add_role :seller
  elsif params[:user][:role] == "admin"
    resource.add_role :admin
  else
    resource.add_role :user
  end

    resource.save